/* 1. Задать температуру в градусах по Цельсию. Вывести в alert соответствующую 
температуру в градусах по Фаренгейту. Подсказка: расчет идет по формуле 
Tf = (9 / 5) * Tc + 32, где Tf — температура по Фаренгейту, Tc — по Цельсию.*/

var temperature = 233;

// Перевод градусов Цельсия в шкалу Фаренгейта
function tF(tC) {
	return (9 / 5) * tC + 32;
}


console.log(`${tF(temperature).toFixed()} по фаренгейту`);

/* 2. Объявить две переменные: admin и name. Записать в name строку "Василий"; 
Скопировать значение из name в admin. Вывести admin (должно вывестись «Василий»)
*/

var name = 'Владислав';
var admin = name;

console.log(admin);

/* 3. * Чему будет равно JS-выражение 1000 + "108"?*/

console.log(1000 + '108');

/* Выражение будет равно 1000108, так как, при сложении числа и строки приоритет
имеет операция конкатинации над сложением, поэтому интерпритатор принудительно
переводт число к строке.*/

/* 4. * Самостоятельно разобраться с атрибутами тега script (async и defer).

При наличии атрибута async браузер при возможности запускает скрипт асинхронно.
Это означает, что указанный в атрибуте src файл будет выполняться без ожидания 
загрузки и отображения веб-страницы. 
В то же время и страница не ожидает результата выполнения скрипта, а продолжает 
загружаться как обычно.

Атрибут defer откладывает выполнение скрипта до тех пор, пока вся страница не 
будет загружена полностью.
*/
